// Задайе значени N. Напишите программу, которая выведет все
// натуральные числа в промежутке от 1 до N.

// void NaturNum(int n){
//     if(n > 0){
//         NaturNum(n-1);
//         Console.WriteLine(n + " ");
//     }
// }

// NaturNum(5);